CSI API ETABS v1
cPropMaterial.AddMaterial Method
 Adds a new material property to the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddMaterial(
	ref string Name,
	eMatType MatType,
	string Region,
	string Standard,
	string Grade,
	string UserName = ""
)
Function AddMaterial (
	ByRef Name As String,
	MatType As eMatType,
	Region As String,
	Standard As String,
	Grade As String,
	Optional UserName As String = ""
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim MatType As eMatType
Dim Region As String
Dim Standard As String
Dim Grade As String
Dim UserName As String
Dim returnValue As Integer
returnValue = instance.AddMaterial(Name,
	MatType, Region, Standard, Grade,
	UserName)
int AddMaterial(
	String^% Name,
	eMatType MatType,
	String^ Region,
	String^ Standard,
	String^ Grade,
	String^ UserName = L""
)
abstract AddMaterial :
        Name : string byref *
        MatType : eMatType *
        Region : string *
        Standard : string *
        Grade : string *
        ?UserName : string
(* Defaults:
        let _UserName = defaultArg UserName ""
*)
-> int
Parameters
Name
Type: System.String
 This item is returned by the program. It is the name that the program ultimately assigns for the material property. If no UserName is specified, the program assigns a default name to the material property. If a UserName is specified and that name is not used for another material property, the UserName is assigned to the material property.
MatType
Type: ETABSv1.eMatType
 This is one of the items in the eMatType enumeration.
Region
Type: System.String
 The region name of the material property that is user-predefined in the file "CSiMaterialLibrary*.xml" located in subfolder "Property Libraries" under the program installation.
Standard
Type: System.String
 The Standard name of the material property with the specified MatType within the specified region.
Grade
Type: System.String
UserName (Optional)
Type: System.String
Return Value
Type: Int32
 Returns zero if the material property is successfully added, otherwise it returns a nonzero value.
Remarks
 This function adds a new material property to the model based on the Code-specified and other pre-defined material properties defined in the installed file "CSiMaterialLibrary*.xml" located in subfolder "Property Libraries" under the program installation folder.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add ASTM A706 rebar material property in United states Region
       ret = SapModel.PropMaterial.AddMaterial(Name, eMatType.Rebar, "United States", "ASTM A706", "Grade 60")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace